<a href="https://colab.research.google.com/github/bugsfamily/android-signaturepad/blob/master/DataFram%E5%88%AA%E9%99%A4%E6%AC%84%E8%A1%8C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

pandas.DataFrame删除/选取含有特定数值的行或列

来源：

https://blog.csdn.net/luocheng7430/article/details/80330566

https://blog.csdn.net/songyunli1111/article/details/79306639 

--------------------- 
用法：
DataFrame.drop(labels=None,axis=0, index=None, columns=None, inplace=False)

参数说明：

labels 就是要删除的行列的名字，用列表给定

axis 默认为0，指删除行，因此删除columns时要指定axis=1；

index 直接指定要删除的行

columns 直接指定要删除的列

inplace=False，默认该删除操作不改变原数据，而是返回一个执行删除操作后的新dataframe；

inplace=True，则会直接在原数据上进行删除操作，删除后无法返回。

因此，删除行列有两种方式：

1）labels=None,axis=0 的组合

2）index或columns直接指定要删除的行或列

In [0]:
df = pd.DataFrame(np.arange(12).reshape(3,4), columns=['A', 'B', 'C', 'D'])
print(df)
df.drop(['B', 'C'], axis=1) #這方法下删除column一定要指定axis=1,否则会报错 
df.drop(columns=['B', 'C'])

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

   A   D
0  0   3
1  4   7
2  8  11

In [0]:
df.drop([0, 1])
df.drop(index=[0, 1])

   A  B   C   D
2  8  9  10  11

In [0]:
import pandas as pd
import numpy as np
 
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(a,index=['row0','row1','row2'],columns=list('ABC'))
print(df)

      A  B  C
row0  1  2  3
row1  4  5  6
row2  7  8  9

In [0]:
# A欄有1的行 == 船除沒1的行
df1=df[df['A'].isin([1])]
print(df1)

      A  B  C
row0  1  2  3

In [0]:
# A欄沒1的行 == 船除有1的行
df1=df[~df['A'].isin([1])]
print(df1)

      A  B  C
row1  4  5  6
row2  7  8  9

In [0]:
#利用enumerate对row0进行遍历，

# 走訪所有column name (列)
cols0=[x for i,x in enumerate(df.columns) ]
print(cols0)

# 将含有数字3的column name (列)放入cols中
cols1=[x for i,x in enumerate(df.columns) if df.iat[0,i]==3]
print(cols1)

['A', 'B', 'C']
['C']

In [0]:
df2=df[cols1]   # 选取含有特定数值的列
print(df2)
df=df.drop(cols1,axis=1) #利用drop方法将含有特定数值的列删除
print(df)

      C
row0  3
row1  6
row2  9
      A  B
row0  1  2
row1  4  5
row2  7  8